{
  "id": "repo-ma8s0ysl",
  "name": "v1",
  "timestamp": "2025-05-03T22:10:37.221Z",
  "repository": "https://github.com/jsayram/RAMS_VCU",
  "fileCount": 2,
  "files": {
    "README.md": "# RAMS\nRemote Aerial Mapping Spectrometer\n\nProject Number: ECE 410\nProject Team: Kenny Parker, José Ramirez, Quan Ma, Chris Lillard\n\nFaculty Adviser: Afroditi Filippas, Ph.D. Sponsor: NASA Langley Research Center Mentor: Stephen Horan, Ph.D.\n\nAccording to the EPA, harmful algal blooms may occur more frequently in coastal areas like the Chesapeake Bay due to warming waters and increased nutrient pollution. Algal blooms cause aquatic dead zones which damage the ecosystem and can produce toxins which are dangerous to animals and humans. Continual environmental monitoring is required to research algal blooms and to prevent harm to resi- dents and industries.\n\nWe researched technologies to locate harmful algal blooms and found spectroscopic remote surveying an effective approach. A material’s wavelength-dependent reflectance reveals its material composition. Unfortunately, existing methods which can map spectral characteristics are lacking. Field researchers with handheld spectrometers may analyze nearby vegetation’s identity and health but surveying a large area is time-consuming. Alternatively, hyperspectral cameras mounted to aircraft and satellites can gather data from a wide region but are cost prohibitive for local studies and provide limited spatial resolution.\n\nWe designed a spectral mapping sensor payload for mounting on unmanned aerial vehicles. The Remote Aerial Mapping Spectrometer (RAMS) adapts to any aircraft able to carry its low weight because it is self-powered and includes all necessary sensors. It scans its surroundings with a laser rangefinder and spectrometer with a long-focus lens. RAMS monitors the orientation of its sensor package and computes a three-dimensional map of nearby material signatures.\n\nThis graphical representation of localized spectra will assist in charting harmful algal blooms but also monitor forests threatened by invasive species and provide pinpoint agricultural analytics. RAMS makes environmental data richer and more cost-effective than current techniques.\n\nKeywords: Remote sensing, unmanned aerial system, 3D scanning, spectroscopy",
    "decode.py": "def decode(a,b):\n\thigh = (a-128)<<7;\n\tlow = (b-128);\n\treturn high + low;\n\ndef main():\n\tprint( \"recovered \", decode(255,255) ) # 2723 encode\n\nif __name__ == \"__main__\":\n\tmain()"
  }
}